In [2]:
import requests
import re
from bs4 import BeautifulSoup
import pandas as pd

In [2]:
def extract_glassdoor_info(url):
   headers = {'User-Agent': 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/75.0.3770.100 Safari/537.36'}
   html = requests.get(url, headers=headers).content
   soup = BeautifulSoup(html, "lxml")
   salary_text = soup.find_all("p", class_="occMedianModule__SeoTextStyle__description tightVert")
   salary_text = str(salary_text)
   salary_list = re.findall("[€|£|\$]\S*", salary_text)
   job_name_list = re.findall("(?<=for\sa\s)\w+\s\w+\s\w+", salary_text)
   country_name_list = re.findall("\w+(?=\.\sFilter)", salary_text)
   salary_info_list = []
   salary_info_list.append(job_name_list[0])
   salary_info_list.append(country_name_list[0])
   salary_info_list.append(salary_list[0])
   return salary_info_list

Dictionary for analyst: Country --> URL to Webpage

In [3]:
country_job_dict = {"Spain_Analyst" : "https://www.glassdoor.com/Salaries/spain-data-analyst-salary-SRCH_IL.0,5_IN219_KO6,18.htm", "Germany_Analyst": "https://www.glassdoor.com/Salaries/germany-data-analyst-salary-SRCH_IL.0,7_IN96_KO8,20.htm", "France_Analyst": "https://www.glassdoor.com/Salaries/france-data-analyst-salary-SRCH_IL.0,6_IN86_KO7,19.htm", "UK_Analyst": "https://www.glassdoor.com/Salaries/uk-data-analyst-salary-SRCH_IL.0,2_IN2_KO3,15.htm", "USA_Analyst": "https://www.glassdoor.com/Salaries/us-data-analyst-salary-SRCH_IL.0,2_IN1_KO3,15.htm", "Spain_Scientist" : "https://www.glassdoor.com/Salaries/spain-data-scientist-salary-SRCH_IL.0,5_IN219_KO6,20.htm", "Germany_Scientist": "https://www.glassdoor.com/Salaries/germany-data-scientist-salary-SRCH_IL.0,7_IN96_KO8,22.htm", "France_Scientist": "https://www.glassdoor.com/Salaries/france-data-scientist-salary-SRCH_IL.0,6_IN86_KO7,21.htm", "UK_Scientist": "https://www.glassdoor.com/Salaries/uk-data-scientist-salary-SRCH_IL.0,2_IN2_KO3,17.htm", "USA_Scientist": "https://www.glassdoor.com/Salaries/us-data-scientist-salary-SRCH_IL.0,2_IN1_KO3,17.htm", "Spain_FinAnalyst": "https://www.glassdoor.com/Salaries/spain-financial-analyst-salary-SRCH_IL.0,5_IN219_KO6,23.htm", "France_FinAnalyst": "https://www.glassdoor.com/Salaries/france-financial-analyst-salary-SRCH_IL.0,6_IN86_KO7,24.htm", "Germany_FinAnalyst": "https://www.glassdoor.com/Salaries/germany-financial-analyst-salary-SRCH_IL.0,7_IN96_KO8,25.htm", "UK_FinAnalyst": "https://www.glassdoor.com/Salaries/uk-financial-analyst-salary-SRCH_IL.0,2_IN2_KO3,20.htm", "USA_FinAnalyst": "https://www.glassdoor.com/Salaries/us-financial-analyst-salary-SRCH_IL.0,2_IN1_KO3,20.htm", "Spain_JrScientist": "https://www.glassdoor.com/Salaries/spain-junior-data-scientist-salary-SRCH_IL.0,5_IN219_KO6,27.htm", "France_JrScientist" :"https://www.glassdoor.com/Salaries/france-junior-data-scientist-salary-SRCH_IL.0,6_IN86_KO7,28.htm", "Germany_JrScientist" :"https://www.glassdoor.com/Salaries/germany-junior-data-scientist-salary-SRCH_IL.0,7_IN96_KO8,29.htm", "UK_JrScientist" :"https://www.glassdoor.com/Salaries/uk-junior-data-scientist-salary-SRCH_IL.0,2_IN2_KO3,24.htm", "US_JrScientist" :"https://www.glassdoor.com/Salaries/us-junior-data-scientist-salary-SRCH_IL.0,2_IN1_KO3,24.htm", "Spain_SrScientist" :"https://www.glassdoor.com/Salaries/spain-senior-data-scientist-salary-SRCH_IL.0,5_IN219_KO6,27.htm", "France_SrScientist" :"https://www.glassdoor.com/Salaries/france-senior-data-scientist-salary-SRCH_IL.0,6_IN86_KO7,28.htm", "Germany_SrScientist" :"https://www.glassdoor.com/Salaries/germany-senior-data-scientist-salary-SRCH_IL.0,7_IN96_KO8,29.htm", "UK_SrScientist" :"https://www.glassdoor.com/Salaries/uk-senior-data-scientist-salary-SRCH_IL.0,2_IN2_KO3,24.htm", "US_SrScientist" :"https://www.glassdoor.com/Salaries/us-senior-data-scientist-salary-SRCH_IL.0,2_IN1_KO3,24.htm", "Spain_JrAnalyst" :"https://www.glassdoor.com/Salaries/spain-junior-data-analyst-salary-SRCH_IL.0,5_IN219_KO6,25.htm", "France_JrAnalyst" :"https://www.glassdoor.com/Salaries/france-junior-data-analyst-salary-SRCH_IL.0,6_IN86_KO7,26.htm", "Germany_JrAnalyst" :"https://www.glassdoor.com/Salaries/germany-junior-data-analyst-salary-SRCH_IL.0,7_IN96_KO8,27.htm", "UK_JrAnalyst" :"https://www.glassdoor.com/Salaries/uk-junior-data-analyst-salary-SRCH_IL.0,2_IN2_KO3,22.htm", "USA_JrAnalyst" :"https://www.glassdoor.com/Salaries/us-junior-data-analyst-salary-SRCH_IL.0,2_IN1_KO3,22.htm", "Spain_SrAnalyst" :"https://www.glassdoor.com/Salaries/spain-senior-data-analyst-salary-SRCH_IL.0,5_IN219_KO6,25.htm", "France_SrAnalyst" :"https://www.glassdoor.com/Salaries/france-senior-data-analyst-salary-SRCH_IL.0,6_IN86_KO7,26.htm", "Germany_SrAnalyst" :"https://www.glassdoor.com/Salaries/germany-senior-data-analyst-salary-SRCH_IL.0,7_IN96_KO8,27.htm", "UK_SrAnalyst" :"https://www.glassdoor.com/Salaries/uk-senior-data-analyst-salary-SRCH_IL.0,2_IN2_KO3,22.htm", "USA_SrAnalyst" :"https://www.glassdoor.com/Salaries/us-senior-data-analyst-salary-SRCH_IL.0,2_IN1_KO3,22.htm", "Spain_JrFinAnalyst" :"https://www.glassdoor.com/Salaries/spain-junior-financial-analyst-salary-SRCH_IL.0,5_IN219_KO6,30.htm", "France_JrFinAnalyst" :"https://www.glassdoor.com/Salaries/france-junior-financial-analyst-salary-SRCH_IL.0,6_IN86_KO7,31.htm", "Germany_JrFinAnalyst" :"https://www.glassdoor.com/Salaries/germany-junior-financial-analyst-salary-SRCH_IL.0,7_IN96_KO8,32.htm", "UK_JrFinAnalyst" :"https://www.glassdoor.com/Salaries/uk-junior-financial-analyst-salary-SRCH_IL.0,2_IN2_KO3,27.htm", "USA_JrFinAnalyst" :"https://www.glassdoor.com/Salaries/us-junior-financial-analyst-salary-SRCH_IL.0,2_IN1_KO3,27.htm", "Spain_SrFinAnalyst" :"https://www.glassdoor.com/Salaries/spain-senior-financial-analyst-salary-SRCH_IL.0,5_IN219_KO6,30.htm", "France_SrFinAnalyst" :"https://www.glassdoor.com/Salaries/france-senior-financial-analyst-salary-SRCH_IL.0,6_IN86_KO7,31.htm", "Germany_SrFinAnalyst" :"https://www.glassdoor.com/Salaries/germany-senior-financial-analyst-salary-SRCH_IL.0,7_IN96_KO8,32.htm", "UK_SrFinAnalyst" :"https://www.glassdoor.com/Salaries/uk-senior-financial-analyst-salary-SRCH_IL.0,2_IN2_KO3,27.htm", "US_SrFinAnalyst": "https://www.glassdoor.com/Salaries/us-senior-financial-analyst-salary-SRCH_IL.0,2_IN1_KO3,27.htm"}

In [ ]:
def vage_calculator_for(country_job):
    return extract_glassdoor_info(country_job_dict[country_job])

In [ ]:
df_salaries = pd.DataFrame([vage_calculator_for(specific_job_in_country) for specific_job_in_country in country_job_dict])

In [ ]:
df_salaries.columns = ["Jobs", "Country", "Salary"]

In [ ]:
import re

In [ ]:
df_salaries

In [ ]:
df_salaries["Jobs"]=df_salaries["Jobs"].apply(lambda x: re.sub("\sis", "", x))

In [ ]:
df_salaries

In [ ]:
country_table = pd.DataFrame(["Spain", "France", "Germany", "Kingdom", "States"])

In [ ]:
country_table = country_table.reset_index()

In [ ]:
country_table

In [ ]:
country_table.columns = ("country_id", "country")

In [ ]:
country_table

In [ ]:
df_salaries.to_csv("df_salaries.csv")

In [ ]:
df_salaries = df_salaries.merge(country_table, left_on="Country", right_on="country")

In [ ]:
df_salaries

In [ ]:
df_salaries_cleaned = df_salaries.drop(columns=["Country", "country"], axis=1)

In [ ]:
df_salaries_cleaned.to_csv("df_salaries_cleaned.csv")

In [ ]:
df_salaries_cleaned = pd.read_csv("df_salaries_cleaned.csv")[["Jobs", "Salary", "country_id"]]

In [ ]:
country_table["country"] = country_table["country"].apply(lambda x: re.sub("Kingdom","United Kingdom", x))

In [ ]:
country_table

In [ ]:
country_table["country"] = country_table["country"].apply(lambda x: re.sub("States","United States", x))

In [ ]:
country_table

In [ ]:
country_table.to_csv("df_country_cleaned.csv")

In [ ]:
# JOB TABLE

In [ ]:
job_table = pd.DataFrame(list(set(df_salaries_cleaned["Jobs"])))

In [ ]:
job_table = job_table.reset_index()

In [ ]:
job_table.columns = ("job_id", "job")

In [ ]:
df_salaries_cleaned = df_salaries_cleaned.merge(job_table, left_on="Jobs", right_on="job")

In [ ]:
df_salaries_cleaned = df_salaries_cleaned.drop(columns=["Jobs", "job"], axis=1)

In [ ]:
df_salaries_cleaned.to_csv("df_salaries_cleaned.csv")

In [ ]:
job_table.to_csv("df_job_cleaned.csv")

In [ ]:
df_country = pd.read_csv("df_country_cleaned.csv")[["country_id", "country"]]

In [ ]:
df_country

In [ ]:
cost_quality_table = pd.read_csv("Avg_and_quality.csv")[["Country", "Average living cost", "Quality of Life Index"]]

In [ ]:
cost_quality_table

In [ ]:
cost_quality_cleaned = cost_quality_table.merge(df_country, left_on="Country", right_on="country")

In [ ]:
cost_quality_cleaned = cost_quality_cleaned.drop(columns=["Country", "country"], axis=1)

In [ ]:
cost_quality_cleaned.columns = ("avg_living_costs", "quality_life_i", "country_id")

In [ ]:
cost_quality_cleaned

In [ ]:
df

In [ ]:
cost_quality_cleaned.to_csv("df_cost_quality_cleaned.csv")

In [ ]:
cost_quality_cleaned.to_csv("df_cost_quality_cleaned.csv")

In [3]:
# Cleaning of the salary data (remove currency sign and remove ",")
df_salaries_corrected = pd.read_csv("df_salaries_cleaned.csv")
df_salaries_corrected.head()

   id   Salary  country_id  job_id
0   0  €31,195           0       1
1   1  €50,399           2       1
2   2  €41,286           1       1
3   3  £30,126           3       1
4   4  $67,377           4       1

In [4]:
df_salaries_corrected["Salary"]=df_salaries_corrected["Salary"].apply(lambda x: re.sub("€|£|,|\$", "", x))

In [5]:
df_salaries_corrected.head()

   id Salary  country_id  job_id
0   0  31195           0       1
1   1  50399           2       1
2   2  41286           1       1
3   3  30126           3       1
4   4  67377           4       1

In [6]:
# Check the type of the dataframe
df_salaries_corrected.dtypes

id             int64
Salary        object
country_id     int64
job_id         int64
dtype: object

In [7]:
# Change the type of the Salary column and check it is now Integer
df_salaries_corrected = df_salaries_corrected.astype({"Salary": int})

In [8]:
df_salaries_corrected.dtypes

id            int64
Salary        int64
country_id    int64
job_id        int64
dtype: object

In [9]:
df_salaries_corrected.head()

   id  Salary  country_id  job_id
0   0   31195           0       1
1   1   50399           2       1
2   2   41286           1       1
3   3   30126           3       1
4   4   67377           4       1

In [10]:
# Convert salary from $ to € by multiplying by 0.89154
df_salaries_corrected["Salary"] = df_salaries_corrected[["Salary", "country_id"]].apply(lambda x: x[0]*0.89154 if x[1] == 4 else x, axis=1)

In [11]:
df_salaries_corrected.head()

   id       Salary  country_id  job_id
0   0  31195.00000           0       1
1   1  50399.00000           2       1
2   2  41286.00000           1       1
3   3  30126.00000           3       1
4   4  60069.29058           4       1

In [12]:
# Convert salary from $ to € by multiplying by 1.107
df_salaries_corrected["Salary"] = df_salaries_corrected[["Salary", "country_id"]].apply(lambda x: x[0]*1.107 if x[1] == 3 else x, axis=1)

In [13]:
df_salaries_corrected.head()

   id       Salary  country_id  job_id
0   0  31195.00000           0       1
1   1  50399.00000           2       1
2   2  41286.00000           1       1
3   3  33349.48200           3       1
4   4  60069.29058           4       1

In [ ]:
df_salaries_corrected.to_csv("df_salaries_corrected.csv")